app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 4)
---
SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("desctiption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["desctiption", "Test"], ["user_id", 1], ["created_at", "2016-07-27 21:14:48.627488"], ["updated_at", "2016-07-27 21:14:48.627488"]]